{"all_meals":{"eb4b7669-f85e-42de-a8d9-9bb3498e7034":{"id":"eb4b7669-f85e-42de-a8d9-9bb3498e7034","image":"https://img.hellofresh.com/c_fit,f_auto,fl_lossy,h_1100,q_50,w_2600/hellofresh_s3/image/southwest-beef-cavatappi-skillet-69c916a9.jpg","ingredients":[{"amount":{"units":"Count","value":1.0},"name":"Long Green Pepper"},{"amount":{"units":"Count","value":2.0},"name":"Scallions"},{"amount":{"units":"Ounce","value":6.0},"name":"Cavatappi Pasta"},{"amount":{"units":"Ounce","value":10.0},"name":"Ground Beef"},{"amount":{"units":"Tablespoon","value":1.0},"name":"Southwest Spice Blend"},{"amount":{"units":"Ounce","value":6.0},"name":"Tomato Paste"},{"amount":{"units":"Count","value":2.0},"name":"Beef Stock Concentrates"},{"amount":{"units":"Tablespoon","value":1.5},"name":"Sour Cream"},{"amount":{"units":"Tablespoon","value":4.0},"name":"Smoky Red Pepper Crema"},{"amount":{"units":"Cup","value":0.5},"name":"Mexican Cheese Blend"},{"amount":{"units":"Teaspoon","value":1.0},"name":"Hot Sauce"}],"name":"Southwest Beef Cavatappi","recipe":[{"description":"Bring a large pot of salted water to a boil. Wash and dry produce. Halve, deseed, and thinly slice green pepper into strips. Trim and thinly slice scallions, separating whites from greens."},{"description":"Once water is boiling, add cavatappi to pot. Cook, stirring occasionally, until al dente (9-11 minutes). Reserve 1 cup pasta cooking water, then drain. Meanwhile, heat a large drizzle of oil in a medium pan over medium-high heat. Add green pepper and season with salt and pepper. Cook, stirring occasionally, until slightly softened (4-5 minutes)."},{"description":"Add a drizzle of oil to pan with green pepper. Add beef, scallion whites, and Southwest Spice Blend. Season with salt and pepper. Cook, breaking up meat into pieces, until beef is browned and cooked through (4-6 minutes). Add tomato paste. Cook, stirring occasionally, until combined (30 seconds)."},{"description":"Add 1/2 cup reserved pasta cooking water and stock concentrates to pan with beef mixture. Season with salt and pepper. Bring to a simmer and cook, stirring until thickened (1-2 minutes)."},{"description":"Reduce heat to low and stir in drained cavatappi, sour cream, smoky red pepper crema, half the Mexican cheese blend, 1 TBSP butter, and hot sauce to taste. Season with salt and pepper to taste."},{"description":"Top beef cavatappi with remaining Mexican cheese blend, cover pan until cheese melts (1-2 minutes). Divide between bowls, top with scallion greens and serve."}],"serving_size":2},"977d23c1-f5aa-4099-be6c-5dd23c47c0eb":{"id":"977d23c1-f5aa-4099-be6c-5dd23c47c0eb","image":"https://img.hellofresh.com/c_fit,f_auto,fl_lossy,h_1100,q_50,w_2600/hellofresh_s3/image/61dddda050f10576b91d9a3b-eba39f47.jpg","ingredients":[{"amount":{"units":"Count","value":1.0},"name":"Zucchini"},{"amount":{"units":"Tablespoon","value":1.0},"name":"Italian Seasoning"},{"amount":{"units":"Ounce","value":9.0},"name":"Italian Chicken Sausage Mix"},{"amount":{"units":"Ounce","value":6.0},"name":"Spaghetti"},{"amount":{"units":"Ounce","value":14.0},"name":"Crushed Tomatoes"},{"amount":{"units":"Count","value":1.0},"name":"Chicken Stock Concentrate"},{"amount":{"units":"Tablespoon","value":1.5},"name":"Sour Cream"},{"amount":{"units":"Tablespoon","value":3.0},"name":"Parmesan Cheese"}],"name":"Chicken Sausage Spaghetti Bolognese","recipe":[{"description":"Heat broiler to high. Bring a large pot of salted water to a boil. Wash and dry produce. Trim and halve zucchini lengthwise. Thinly slice crosswise into half-moons."},{"description":"Toss zucchini on a baking sheet with a large drizzle of olive oil, half the Italian Seasoning, salt, and pepper. Broil until browned and softened (5-7 minutes)."},{"description":"Meanwhile, heat a drizzle of olive oil in a large pan over medium-high heat. Add sausage and remaining Italian Seasoning. Cook, breaking up meat into pieces, until browned and cooked through (4-6 minutes)."},{"description":"Once water is boiling, add spaghetti to pot. Cook, stirring occasionally, until al dente (9-11 minutes). Reserve 1/2 cup pasta cooking water, then drain and set aside."},{"description":"While pasta cooks, stir crushed tomatoes, stock concentrate, and 1 tsp sugar into pan with sausage. Season generously with salt and pepper. Bring to a simmer and cook until reduced (5-7 minutes)."},{"description":"Stir sour cream and 1 tbsp butter into pan with sauce until melted and combined. Add zucchini and drained spaghetti. Toss to coat. If needed, stir in reserved pasta cooking water 1 TBSP at a time until pasta is thorougly coated in sauce. Taste and season with salt and pepper."}],"serving_size":2}},"planned_meals":{}}